"""
Написать функцию, которая будет проверять четность некоторого числа.
		def is_even(number): # returns boolean value
"""

def is_even (number):
    return number % 2 == 0

print (is_even (6))
print (is_even (5))